#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ГрузовоеМесто) Тогда
		ГрузовоеМесто = РегистрыСведений.НумераторГрузовоеМесто.ПолучитьСледующий(Год(Дата));
	КонецЕсли;		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Остатки.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.Остатки.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.ГрузовоеМесто = ГрузовоеМесто;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#КонецЕсли
