#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтгрузкаТоваровТовары.Товар КАК Товар,
		|	ОтгрузкаТоваровТовары.ГрузовоеМесто КАК ГрузовоеМесто,
		|	СУММА(ОтгрузкаТоваровТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары КАК ОтгрузкаТоваровТовары
		|ГДЕ
		|	ОтгрузкаТоваровТовары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ОтгрузкаТоваровТовары.Товар,
		|	ОтгрузкаТоваровТовары.ГрузовоеМесто
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ГрузовоеМесто,
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Товар,
		|	втТовары.ГрузовоеМесто,
		|	втТовары.Количество,
		|	&Период КАК Период,
		|	&Склад КАК Склад,
		|	&Контрагент КАК Контрагент
		|ИЗ
		|	втТовары КАК втТовары";
    
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
    
	Выборка = Запрос.Выполнить().Выбрать();   
	Пока Выборка.Следующий() Цикл 
		Движение = Движения.Остатки.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);

		Движение = Движения.Отгрузки.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;

	Движения.Остатки.БлокироватьДляИзменения = Истина;
	Движения.Остатки.Записывать = Истина;
	Движения.Отгрузки.Записывать = Истина;	
	Движения.Записать();

    Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Товар КАК Товар,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Остатки.Товар) КАК ТоварПредставление,
		|	-Остатки.КоличествоОстаток КАК Дефицит,
		|	Остатки.ГрузовоеМесто,
		|	Остатки.Товар,
		|	Остатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Остатки.Остатки(&МоментВремени, (Товар, ГрузовоеМесто) В
		|		(ВЫБРАТЬ
		|			втТовары.Товар КАК Товар,
		|			втТовары.ГрузовоеМесто КАК ГрузовоеМесто
		|		ИЗ
		|			втТовары КАК втТовары)
		|	И Склад = &Склад) КАК Остатки
		|ГДЕ
		|	Остатки.КоличествоОстаток < 0";
   
    Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Склад", Склад);
    РезультатЗапроса = Запрос.Выполнить();
   
    Если Не РезультатЗапроса.Пустой() Тогда
        Отказ = Истина;
        ВыборкаОшибки = РезультатЗапроса.Выбрать();
        Пока ВыборкаОшибки.Следующий() Цикл
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = СтрШаблон(НСтр("ru='Товара <%1> в грузовом месте <%2> недостаточно в количестве <%3> шт.'"), 
											ВыборкаОшибки.ТоварПредставление, ВыборкаОшибки.ГрузовоеМесто, ВыборкаОшибки.Дефицит);
            Сообщение.Сообщить();
        КонецЦикла;
    КонецЕсли;
КонецПроцедуры
#КонецОбласти

#КонецЕсли
