

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//@skip-check optional-form-parameter-access
	Если НЕ Параметры.Свойство("Склад") ИЛИ НЕ ЗначениеЗаполнено(Параметры.Склад) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

    Склад = Параметры.Склад;
	Остатки.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	ТоварыВДокументе.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	//@skip-check unknown-form-parameter-access
	Остатки.Параметры.УстановитьЗначениеПараметра("МоментВремени", Параметры.МоментВремени);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОстатки
&НаКлиенте
Процедура ОстаткиПриАктивизацииСтроки(Элемент)
	Если Элементы.Остатки.ТекущиеДанные = Неопределено Тогда
		ОстаткиПриАктивизацииСтрокиНаСервере(Неопределено);
	Иначе
		ОстаткиПриАктивизацииСтрокиНаСервере(Элементы.Остатки.ТекущиеДанные.Товар);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументов
&НаКлиенте
Процедура СписокДокументовПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокДокументов.ТекущиеДанные = Неопределено Тогда
		СписокДокументовПриАктивизацииСтрокиНаСервере(Неопределено);
	Иначе
		СписокДокументовПриАктивизацииСтрокиНаСервере(Элементы.СписокДокументов.ТекущиеДанные.ГрузовоеМесто);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(ВыбраннаяСтрока);
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОстаткиПриАктивизацииСтрокиНаСервере(Товар)
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Товар", Товар);	
КонецПроцедуры

&НаСервере
Процедура СписокДокументовПриАктивизацииСтрокиНаСервере(ГрузовоеМесто)
	ТоварыВДокументе.Параметры.УстановитьЗначениеПараметра("ГрузовоеМесто", ГрузовоеМесто);
КонецПроцедуры
#КонецОбласти

